<?php include 'header.php' ?>

<div class="content">
<h2 align="center">Добро пожаловать!</h2>
Теорема о детерминизации утверждает, что для любого конечного автомата может
быть построен эквивалентный ему детерминированный конечный автомат (два
конечных автомата называют эквивалентными, если их языки совпадают). Однако
поскольку количество состояний в эквивалентном ДКА в худшем случае растёт
экспоненциально с ростом количества состояний исходного НКА, на практике
подобная детерминизация не всегда возможна, епта.
	<center>
		<button class="button">
			<h2>Случайный автомат!</h2>
		</button>
	</center>
</div>


<?php include 'footer.php' ?>